{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 100, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_3_1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32", "quantization": {"min": -0.5582467686896231, "scale": 0.004197344125485888, "dtype": "uint8"}}, {"name": "conv2d_3_1/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.40887692670027415, "scale": 0.0021865076294132306, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"min": -0.8117532028871425, "scale": 0.006012986688052907, "dtype": "uint8"}}, {"name": "conv2d_4/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.38013905777650725, "scale": 0.0023465373936821434, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.7980389496859382, "scale": 0.005428836392421348, "dtype": "uint8"}}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.3668076848866893, "scale": 0.001982744242630753, "dtype": "uint8"}}, {"name": "dense_2_1/kernel", "shape": [576, 128], "dtype": "float32", "quantization": {"min": -0.7105313651701983, "scale": 0.005148778008479698, "dtype": "uint8"}}, {"name": "dense_2_1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.17310507069615758, "scale": 0.0015052614843144136, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [128, 100], "dtype": "float32", "quantization": {"min": -1.6940317261452769, "scale": 0.008732122299717923, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [100], "dtype": "float32", "quantization": {"min": -0.19825919551007887, "scale": 0.0017391157500884112, "dtype": "uint8"}}]}]}